### Terraform `plan` Failed for Workspace: `testing`
<details><summary>Show Output</summary>

```diff
Terraform planned the following actions, but then encountered a problem:

  # module.test_vpc.aws_eip.nat[3] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "test"
        }
+       tags_all             = {
+           "Environment" = "test"
        }
+       vpc                  = true
    }

  # module.test_vpc.aws_route_table.private[3] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "test"
        }
+       tags_all         = {
+           "Environment" = "test"
        }
+       vpc_id           = "vpc-test"
    }

  # module.test_vpc.aws_subnet.public[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_subnet" "public" {
-       arn                                            = "arn:aws:ec2:test_region:test_account_2:subnet/subnet-test" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "test" -> null
-       availability_zone_id                           = "test" -> null
-       cidr_block                                     = "test" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-test" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "test_account_2" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Environment"                               = "test"
        } -> null
-       tags_all                                       = {
-           "Environment"                               = "test"
        } -> null
-       vpc_id                                         = "vpc-test" -> null

-       timeouts {}
    }

Plan: 2 to add, 0 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_test_addon.test,
│   on test-addons.tf line 6, in resource "aws_test_addon" "test":
│    6:   resolve_conflicts = "OVERWRITE"
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 10 more similar warnings elsewhere)
╵
╷
│ Error: Error in function call
│ 
│   on modules/vpc/test.tf line 868, in resource "aws_nat_gateway" "this":
│  868:   subnet_id = element(
│  869:     aws_subnet.public.*.id,
│  870:     var.single_nat_gateway ? 0 : count.index,
│  871:   )
│     ├────────────────
│     │ while calling element(list, index)
│     │ aws_subnet.public is empty tuple
│     │ count.index is 0
│     │ var.single_nat_gateway is false
│ 
│ Call to function "element" failed: cannot use element function with an
│ empty list.
╵
╷
│ Error: Error in function call
│ 
│   on modules/vpc/test.tf line 868, in resource "aws_nat_gateway" "this":
│  868:   subnet_id = element(
│  869:     aws_subnet.public.*.id,
│  870:     var.single_nat_gateway ? 0 : count.index,
│  871:   )
│     ├────────────────
│     │ while calling element(list, index)
│     │ aws_subnet.public is empty tuple
│     │ count.index is 2
│     │ var.single_nat_gateway is false
│ 
│ Call to function "element" failed: cannot use element function with an
│ empty list.
╵
╷
```
</details>